# ElevArrowFilled Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ElevArrowFilled Property
ParameterTypeId Class See Also
---
"Filled"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ElevArrowFilled { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ElevArrowFilled As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ElevArrowFilled {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace